In [14]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\ryan_\anaconda3\lib\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [42]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import gmaps
import os
import scipy.stats as st
from sqlalchemy import create_engine

In [43]:
lifeexpectancy = pd.read_csv('Lifeexpectancy.csv')

In [44]:
countries_df = pd.DataFrame(lifeexpectancy)
countries_df.head()

      Entity  Year  Life expectancy
0  Australia  1802        34.049999
1  Australia  1803        34.049999
2  Australia  1804        34.049999
3  Australia  1805        34.049999
4  Australia  1806        34.049999

In [45]:
clean_countries_df = countries_df [["Entity","Year","Life expectancy"]].copy()
clean_countries_df.head()

      Entity  Year  Life expectancy
0  Australia  1802        34.049999
1  Australia  1803        34.049999
2  Australia  1804        34.049999
3  Australia  1805        34.049999
4  Australia  1806        34.049999

In [62]:
clean_countries_filtered_df  = clean_countries_df[clean_countries_df['Year'] >= 1970]
print(clean_countries_filtered_df)

             Entity  Year  Life expectancy
168       Australia  1970        70.809998
169       Australia  1971        71.410004
170       Australia  1972        71.930000
171       Australia  1973        72.139999
172       Australia  1974        71.889999
...             ...   ...              ...
3248  United States  2012        78.940002
3249  United States  2013        78.959999
3250  United States  2014        78.940002
3251  United States  2015        78.870003
3252  United States  2016        78.860001

[705 rows x 3 columns]

In [66]:
clean_countries_filtered_df.rename(columns = {'Country_Name':'country_name'}, inplace = True)
print("\nAfter modifying first column:\n", clean_countries_filtered_df.columns)
clean_countries_filtered_df

After modifying first column:
 Index(['country_name', 'Year', 'Life expectancy'], dtype='object')

C:\Users\ryan_\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

       country_name  Year  Life expectancy
168       Australia  1970        70.809998
169       Australia  1971        71.410004
170       Australia  1972        71.930000
171       Australia  1973        72.139999
172       Australia  1974        71.889999
...             ...   ...              ...
3248  United States  2012        78.940002
3249  United States  2013        78.959999
3250  United States  2014        78.940002
3251  United States  2015        78.870003
3252  United States  2016        78.860001

[705 rows x 3 columns]

In [67]:
clean_countries_filtered_df.rename(columns = {'Year':'year'}, inplace = True)
print("\nAfter modifying first column:\n", clean_countries_filtered_df.columns)
clean_countries_filtered_df

After modifying first column:
 Index(['country_name', 'year', 'Life expectancy'], dtype='object')

C:\Users\ryan_\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

       country_name  year  Life expectancy
168       Australia  1970        70.809998
169       Australia  1971        71.410004
170       Australia  1972        71.930000
171       Australia  1973        72.139999
172       Australia  1974        71.889999
...             ...   ...              ...
3248  United States  2012        78.940002
3249  United States  2013        78.959999
3250  United States  2014        78.940002
3251  United States  2015        78.870003
3252  United States  2016        78.860001

[705 rows x 3 columns]

In [68]:
clean_countries_filtered_df.rename(columns = {'Life expectancy':'life_expectancy'}, inplace = True)
print("\nAfter modifying first column:\n", clean_countries_filtered_df.columns)
clean_countries_filtered_df

After modifying first column:
 Index(['country_name', 'year', 'life_expectancy'], dtype='object')

C:\Users\ryan_\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

       country_name  year  life_expectancy
168       Australia  1970        70.809998
169       Australia  1971        71.410004
170       Australia  1972        71.930000
171       Australia  1973        72.139999
172       Australia  1974        71.889999
...             ...   ...              ...
3248  United States  2012        78.940002
3249  United States  2013        78.959999
3250  United States  2014        78.940002
3251  United States  2015        78.870003
3252  United States  2016        78.860001

[705 rows x 3 columns]

In [57]:
rds_connection_string = "postgres:College#01231996@localhost:5432/ETLProject_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [39]:
 engine.table_names()

[]

In [40]:
countries_df.to_sql(name='countries_list', con=engine, if_exists='append', index=False)

In [41]:
pd.read_sql_query('select * from countries_list', con=engine).head()

      Entity  Year  Life expectancy
0  Australia  1802        34.049999
1  Australia  1803        34.049999
2  Australia  1804        34.049999
3  Australia  1805        34.049999
4  Australia  1806        34.049999